--------------------------------------------------------------------------------



--------------------------------------------------------------------------------
--- @type ForgeCraftRecipeId - ресурс рецепта крафта
--- @type ForgeCraftResourceId -- GetInfo - ресурс forge крафта
--------------------------------------------------------------------------------
--var_dump( craft.GetForgeRecipes() )

--------------------------------------------------------------------------------
--- @type SpellId
--- @type ActionGroupId -- GetInfo
--------------------------------------------------------------------------------
--var_dump( avatar.GetSpellBook() )

--------------------------------------------------------------------------------
--- @type RecipeId
--- @type ComponentPropertyId
--------------------------------------------------------------------------------
--var_dump( avatar.GetAlchemyInfo() )

--------------------------------------------------------------------------------
--- @type ValuedText
--- @type RelatedTextsLua
--------------------------------------------------------------------------------
--[[ local group = common.GetAddonRelatedTextGroup( "template", true )
local vt = common.CreateValuedText {
    format = group:GetText( "RECIPE_LINE" ),
    level = 5,
}
var_dump( vt, group ) ]]

--------------------------------------------------------------------------------
--- @type AbilityId
--------------------------------------------------------------------------------
--var_dump( avatar.GetAbilities()[1] )

--------------------------------------------------------------------------------
--- @type BattlegroundMarkId
--------------------------------------------------------------------------------
--var_dump( battleground.GetAvatarMark() )

--------------------------------------------------------------------------------
--- @type BuffId
--------------------------------------------------------------------------------
--[[ for buffId, buffInfo in pairs( object.GetBuffsInfo( avatar.GetId(), true, true ) ) do
    var_dump( buffId, buffInfo )
end ]]

--------------------------------------------------------------------------------
--- @type CharacterClassId
--------------------------------------------------------------------------------
--var_dump( avatar.GetClassId() )

--------------------------------------------------------------------------------
--- Пробовать на обличие класса, например: демонолог
--- @type CharacterFormId
--------------------------------------------------------------------------------
--var_dump( unit.GetCharacterForm( avatar.GetId() ) )

--------------------------------------------------------------------------------
--- @type CurrencyId
--- @type CurrencyCategoryId
--------------------------------------------------------------------------------
--var_dump( avatar.GetCurrencyId( "myrrh" ) )

--------------------------------------------------------------------------------
--- @type FactionId
--------------------------------------------------------------------------------
--var_dump( unit.GetFactionId( avatar.GetId() ) )

--------------------------------------------------------------------------------
--- @type UnlockId
--- @type UnlockCategoryId
--------------------------------------------------------------------------------
--[[ for _, unlockId in ipairs( avatar.GetUnlocks() ) do
    var_dump( avatar.GetUnlockInfo( unlockId ) )
end ]]

--------------------------------------------------------------------------------
--- @type LifestyleCategoryId
--------------------------------------------------------------------------------
--var_dump( checkroomLib.GetCategories() )

--------------------------------------------------------------------------------
--- @type GlossaryId ?
--------------------------------------------------------------------------------
--var_dump( test )

--------------------------------------------------------------------------------
--- @type GoalId
--------------------------------------------------------------------------------
--var_dump( common.GetAllodsGoalsOnLoadingScreen() )

--------------------------------------------------------------------------------
--- @type InstancedEventCategoryId
--------------------------------------------------------------------------------
--var_dump( matchMaking.GetEventCategories() )

--------------------------------------------------------------------------------
--- @type InstancedEventResourceId
--------------------------------------------------------------------------------
--var_dump( mwar.GetCommonMatchMakingInfo() )

--------------------------------------------------------------------------------
--- @type InterfaceMapMarkerId
--------------------------------------------------------------------------------
--var_dump( cartographer.GetMapMarkers( cartographer.GetCurrentZoneInfo().zonesMapId ) )

--------------------------------------------------------------------------------
--- @type ItemCategoryId
--------------------------------------------------------------------------------
--var_dump( itemLib.GetRootCategories() )

--------------------------------------------------------------------------------
--- пробовать на локации, например: Царство стихий. ["name"] => WString(16) "Огнеяр повержен!"
--- @type MapModifierId
--------------------------------------------------------------------------------
--var_dump( cartographer.GetCurrentMapModifiers() )

--------------------------------------------------------------------------------
--- @type PostTypeId
--------------------------------------------------------------------------------
--var_dump( bulletinBoard.GetSectionInfos() )

--------------------------------------------------------------------------------
--- Находиться в ангаре с кораблём своим
--- @type ShipSkinId
--------------------------------------------------------------------------------
--var_dump( hangar.GetAvailableSkins() )

--------------------------------------------------------------------------------
--- @type SpecialStatId
--------------------------------------------------------------------------------
--var_dump( avatar.GetRecommendedStats() )

--------------------------------------------------------------------------------
--- @type TutorialCategoryId
--- @type TutorialId
--------------------------------------------------------------------------------
--[[ local categories = tutorialLib.GetCategories() -- TutorialCategoryId
local tutorialIds = tutorialLib.GetCategoryContent( categories[1] ) -- TutorialId
var_dump( categories, tutorialIds ) ]]

--------------------------------------------------------------------------------
--- @type VariableId
--------------------------------------------------------------------------------
--var_dump( avatar.GetVariables() )

--------------------------------------------------------------------------------
--- Тест на цикличность
--------------------------------------------------------------------------------
--[[ local a = { w = userMods.ToWString( "rrr" ), d = nil}
local b = { c = a.w, a = a }
a.d = b
var_dump( a ) ]]

--------------------------------------------------------------------------------
--- @type ItemClassId
--------------------------------------------------------------------------------
--var_dump( avatar.GetItemClassList() )

--------------------------------------------------------------------------------
--- @type OrderBonusId
--------------------------------------------------------------------------------
--var_dump( order.GetOrderBonus() )

--------------------------------------------------------------------------------
--- Reforge (перековка) - это механика в кузнечном деле. Позволяет улучшать качество создаваемых предметов. 
--- @type ReforgeResourceId
--------------------------------------------------------------------------------
--???var_dump( craft.GetReforgeRecipe() )

--------------------------------------------------------------------------------
--- @type ZodiacSignId
--------------------------------------------------------------------------------
--[[ local id = unit.GetEquipmentItemId( avatar.GetId(), DRESS_SLOT_OFFENSIVERUNE1, ITEM_CONT_EQUIPMENT )
local itemRuneInfo = itemLib.GetRuneInfo( id )
var_dump( itemRuneInfo ) ]]

--------------------------------------------------------------------------------
--- @type userdata | table Widget
--------------------------------------------------------------------------------
--var_dump( common.GetAddonMainForm( "UserAddon/LibreAlchemyV2" ) )
--var_dump( mainForm )
--var_dump( _G )
--------------------------------------------------------------------------------
--- @type FactoryCacheSafe | lightuserdata
--------------------------------------------------------------------------------
--var_dump( mainForm:GetFactoryCache() )
--[[ local cache = mainForm:GetFactoryCache()
common.LogInfo("common", "type=" .. type(cache) .. " apitype=" .. apitype(cache) ) ]]
--------------------------------------------------------------------------------
--- @type test
--------------------------------------------------------------------------------
--var_dump( test )

--------------------------------------------------------------------------------
--- @type test
--------------------------------------------------------------------------------
--var_dump( test )











--------------------------------------------------------------------------------
------------------------------- Lua API Release --------------------------------
--------------------------------------------------------------------------------

-- Удалены следующие функции:
-- https://alfa-ao.github.io/allods-lua-api-docs/#18.0.0-spellLib._DurationBuff
--var_dump( "#18.0.0-spellLib._DurationBuff", spellLib.HasDurationBuff, spellLib.GetDurationBuff )

--------------------------------------------------------------------------------

-- Индексация возвращаемой таблицы становится валидным 0 => 1
-- https://alfa-ao.github.io/allods-lua-api-docs/#17.0.0-options.Get...Ids
--var_dump( "#17.0.0-options.Get...Ids", options.GetPageIds() )

--------------------------------------------------------------------------------

-- Вместо функции: options.SetOptionCurrentIndex.
-- Разделены по типу на булевые / все остальные. Можно передать 3 аргумент true для мгновенного применения.
-- https://alfa-ao.github.io/allods-lua-api-docs/#17.0.0-options.SetOptionCurrentIndex
--var_dump( "#17.0.0-options.SetOptionCurrentIndex", options.SetOptionCurrentIndex, options.SetOptionEnabled, options.SetOptionIndex )

--------------------------------------------------------------------------------

-- Новые API
-- https://alfa-ao.github.io/allods-lua-api-docs/#17.0.0-options.IsOptionEnabled
--var_dump( "#17.0.0-options.IsOptionEnabled", options.IsOptionEnabled )

--------------------------------------------------------------------------------

-- Тип UniqueId меняется с userdata на number (int64) во всех связанных API. Соответственно все методы UniqueId исчезают.
-- https://alfa-ao.github.io/allods-lua-api-docs/#17.0.0-UniqueId
--var_dump( "#17.0.0-UniqueId", avatar.GetUniqueId() )

--------------------------------------------------------------------------------

-- Аддоны использующие кастомные стили должны будут явно их загрузить. 
-- Появится специальная API: common.LoadCustomCss( id ) - загружает набор стилей аддона с заданным id.
-- https://alfa-ao.github.io/allods-lua-api-docs/#17.0.0-WidgetCss
--var_dump( "#17.0.0-WidgetCss", common.LoadCustomCss )

--------------------------------------------------------------------------------

-- Функция DEPRECATED. Аналог common.SendUserModsEvent
-- https://alfa-ao.github.io/allods-lua-api-docs/#16.0.0-userMods.SendEvent
--var_dump( "#16.0.0-userMods.SendEvent", userMods.SendEvent )

--------------------------------------------------------------------------------
